import cmath

def solve_quadratic_equation(a, b, c):
    """
    Розв'язує квадратне рівняння вигляду ax^2 + bx + c = 0.

    Аргументи:
    a (float): Коефіцієнт при x^2.
    b (float): Коефіцієнт при x.
    c (float): Вільний член.

    Повертає:
    tuple: Корінь(корені) рівняння.
           Якщо дискримінант додатний, повертає (x1, x2).
           Якщо дискримінант дорівнює нулю, повертає (x1,).
           Якщо дискримінант від'ємний, повертає (x1, x2) - комплексні корені.
           Повертає None, якщо 'a' дорівнює 0 (не квадратне рівняння).
    """
    if a == 0:
        return None

    # Обчислення дискримінанта
    delta = (b**2) - 4*(a*c)

    # Умови для коренів
    if delta > 0:
        x1 = (-b - cmath.sqrt(delta)) / (2*a)
        x2 = (-b + cmath.sqrt(delta)) / (2*a)
        return x1, x2
    elif delta == 0:
        x1 = -b / (2*a)
        return x1,
    return None, 
